---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopyImposterLightWarn
source: html/e820d78a-40a0-b4e6-46a3-1699e9a3d214.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopyImposterLightWarn Property

Light source cannot be copied!

## Syntax (C#)
```csharp
public static FailureDefinitionId CopyImposterLightWarn { get; }
```